import SongPage from '../../components/songs/SongPage'
import ParallelTranslation from '../../components/ParallelTranslation'
import type { PageProps } from './types'
import { css } from '@linaria/core'

const title = 'カッコウ'

export const documentProps = {
  title,
  publishedAt: '2022-10-25T12:41:53+09:00'
}

const originalLyrics = `
1.
Песен еще не написанных, сколько?
Скажи, кукушка, пропой.
В городе мне жить или на выселках,
Камнем лежать или гореть звездой? Звездой.

Припев:
Солнце моё - взгляни на меня,
Моя ладонь превратилась в кулак,
И если есть порох - дай огня.
Вот так...

2.
Кто пойдёт по следу одинокому?
Сильные да смелые головы сложили в поле в бою.
Мало кто остался в светлой памяти,
В трезвом уме да с твёрдой рукой в строю, в строю.

Припев.

3.
Где же ты теперь, воля вольная?
С кем же ты сейчас ласковый рассвет встречаешь? Ответь.
Хорошо с тобой, да плохо без тебя,
голову да плечи терпеливые под плеть, под плеть.

Припев.

Припев.
`

const translation = `
1.
まだ書かれていない歌はいくつある?
教えてくれ、カッコウ、歌ってくれ
私は街で生きるべきか、それとも村か
石のように横たわるべきか、星のように燃えるべきか? 星のように

繰り返し:
私の太陽よ、私を見てくれ
私の掌は拳になった
そしてもし火薬があるなら、炎をくれ
ほら……

2.
孤独な足跡を辿ろうとしているのは誰だ?
強く勇敢な者たちは戦いの中で草原に横たわった
隊列の中、醒めた頭と不屈の腕を持ったままで
明るい記憶に残る者は少ない

繰り返し

3.
お前は今どこにいる、自由な意志よ
お前は誰と優しい夜明けを迎えている? 答えてくれ
お前といるのが喜びで、お前なしでは生きられない
頭も我慢強い肩も鞭の下へ

繰り返し

繰り返し
`

const description = css`
  margin-block-start: 4em;
`

export function Page(props: PageProps) {
  return (
    <SongPage {...props}>
      <ParallelTranslation original={originalLyrics} translation={translation} />
      <section className="western-text">
        <h2>文法解説</h2>
        <blockquote>
          <p>В городе мне жить или на выселках,<br />Камнем лежать или гореть звездой</p>
        </blockquote>
        <p>与格 + 動詞の不定形で「〜は〜するべき」という意味を表します。こういった不定形の構文は疑問詞とセットで使われることが多いですが(例: Как мне жить?「私はどういうふうに生きるべきか?」)、疑問詞を使わない用例もあります。</p>
        <p>また、ここでのкамнемやзвездойは造格で、比喩の意味を表します。</p>
      </section>
      <p className={description}>ヴィクトル・ツォイの歌詞、だいたい抽象的すぎてどう訳せばいいか分からない。正直、ちゃんと訳せている自信が一切ありません。</p>
    </SongPage>
  )
}
