import SongPage from '../../components/songs/SongPage'
import ParallelTranslation from '../../components/ParallelTranslation'
import type { PageProps } from './types'

const title = 'ロシア国歌 (2000年)'

export const documentProps = {
  title,
  publishedAt: '2022-10-25T12:41:53+09:00'
}

const originalLyrics = `
1.
Россия — священная наша держава,
Россия — любимая наша страна.
Могучая воля, великая слава —
Твоё достоянье на все времена!

Припев:
Славься, Отечество наше свободное,
Братских народов союз вековой,
Предками данная мудрость народная!
Славься, страна! Мы гордимся тобой!

2.
От южных морей до полярного края
Раскинулись наши леса и поля.
Одна ты на свете! Одна ты такая —
Хранимая Богом родная земля!

Припев.

3.
Широкий простор для мечты и для жизни
Грядущие нам открывают года.
Нам силу даёт наша верность Отчизне.
Так было, так есть и так будет всегда!

Припев.
`

const translation = `
1.
ロシア、聖なる我らの国家
ロシア、愛しい我らの国
強力な意志、偉大な栄光
それはいつのときも汝のもの

繰り返し:
栄光あれ、我らの自由な祖国よ
兄弟のような諸民族の長年の結束よ
父祖より与えられた人々の英知よ!
祖国よ栄光あれ! 我らは汝を誇りに思う!

2.
南の海から極地まで
広がっている我らの森林と草原
世界で唯一の汝よ! 世界で唯一の
神に守られし故郷の大地よ!

繰り返し

3.
夢と人生への広き自由を
我らに開くのは来たる時代
我らに力を与えるのは祖国に対する我らの忠誠
それは過去も現在も未来も、永遠にそうだ

繰り返し
`

export function Page(props: PageProps) {
  return (
    <SongPage {...props}>
      <ParallelTranslation original={originalLyrics} translation={translation} />
    </SongPage>
  )
}
