import SongPage from '../../components/songs/SongPage'
import ParallelTranslation from '../../components/ParallelTranslation'
import type { PageProps } from './types'

const title = '聖なる戦い'

export const documentProps = {
  title
}

const originalLyrics = `
1.
Вставай, страна огромная,
Вставай на смертный бой
С фашистской силой тёмною,
С проклятою ордой.

Припев:
Пусть ярость благородная
Вскипает, как волна, —
Идёт война народная,
Священная война!

Припев.

2.
Как два различных полюса,
Во всём враждебны мы.
За свет и мир мы боремся,
Они — за царство тьмы.

Припев.

3.
Дадим отпор душителям
Всех пламенных идей,
Насильникам, грабителям,
Мучителям людей!

Припев.

4.
Не смеют крылья чёрные
Над Родиной летать,
Поля её просторные
Не смеет враг топтать!

Припев.

5.
Гнилой фашистской нечисти
Загоним пулю в лоб,
Отребью человечества
Сколотим крепкий гроб!

Припев.

6.
Пойдём ломить всей силою,
Всем сердцем, всей душой
За землю нашу милую,
За наш Союз большой!

Припев.

7.
Встаёт страна огромная,
Встаёт на смертный бой
С фашистской силой тёмною,
С проклятою ордой!

Припев.
`

const translation = `
1.
立ち上がれ、巨大な国よ
立ち上がれ、死闘へと
ファシストの闇の軍勢との、
呪わしい敵どもとの戦いへと

繰り返し:
高潔な憤怒を
波のように沸き立たせよ
今行われているのは人民の戦い、
聖なる戦いだ!

繰り返し

2.
二つの異なる極のように
我々と奴らは全てにおいて敵対している
我々は光と平和のために戦う
奴らは闇の帝国のために

繰り返し

3.
我らは反撃を加える、
全ての情熱的な思想の抑圧者たちに、
弾圧者たちに、略奪者たちに、
人々を迫害する者たちに!

繰り返し

4.
黒い翼は
祖国の上を飛べない
祖国の広大な草原を敵が
踏むことはできない

繰り返し

5.
腐ったファシストのろくでなしどもの
額に弾丸を撃ち込んでやる
人類の屑どもに
頑丈な棺桶を作ってやろう!

繰り返し

6.
全力を以って、
全身全霊で撃破せよ、
我らの愛しい大地のために、
我らの大いなる連邦のために!

繰り返し

7.
立ち上がるのだ、巨大な国が
立ち上がるのだ、死闘へと
ファシストの闇の軍勢との、
呪わしい敵どもとの戦いへと!

繰り返し
`

export function Page(props: PageProps) {
  return (
    <SongPage {...props}>
      <ParallelTranslation original={originalLyrics} translation={translation} />
      <section>
        <h2>解説</h2>
        <p>このページでは新聞に掲載されたオリジナルの歌詞を採用しましたが、1〜7番のうち2番、6番、7番は大抵の音源で飛ばされています。</p>
      </section>
    </SongPage>
  )
}
