import SongPage from '../../components/songs/SongPage'
import ParallelTranslation from '../../components/ParallelTranslation'
import type { PageProps } from './types'

const title = 'ソ連国歌 (1977年)'

export const documentProps = {
  title,
  publishedAt: '2022-10-25T05:26:37+09:00'
}

const originalLyrics = `
1.
Союз нерушимый республик свободных
Сплотила навеки Великая Русь.
Да здравствует созданный волей народов
Единый, могучий Советский Союз!

Припев:
Славься, Отечество наше свободное,
Дружбы народов надёжный оплот!
Партия Ленина ― сила народная
Нас к торжеству коммунизма ведёт!

2.
Сквозь грозы сияло нам солнце свободы,
И Ленин великий нам путь озарил:
На правое дело он поднял народы,
На труд и на подвиги нас вдохновил!

Припев.

3.
В победе бессмертных идей коммунизма
Мы видим грядущее нашей страны,
И Красному знамени славной Отчизны
Мы будем всегда беззаветно верны!

Припев.
`
const translation = `
1.
自由な諸共和国の揺るぎない連邦を
大ルーシは永遠に団結させた!
万歳、諸民族の意思によって築かれた
1つの強力なソヴィエト連邦よ!

繰り返し:
栄光あれ、我らの自由な祖国よ、
諸民族の友好の確かな砦よ!
レーニンの党、人民の力は
我らを共産主義の勝利へ導く!

2.
雷雨を貫いて自由の太陽が我らに輝き
そして偉大なレーニンは我らに道を照らし示した
そして彼は正義の事業へ諸民族を鼓舞し
労働へ、そして偉業へ我々を奮い立たせた!

繰り返し

3.
共産主義という不滅の思想の勝利に
我々は我らの国の未来を見出す
そして栄誉ある祖国の赤い旗に
我々は常に、献身的に忠実であり続ける!

繰り返し
`

export function Page(props: PageProps) {
  return (
    <SongPage {...props}>
      <ParallelTranslation original={originalLyrics} translation={translation} />
    </SongPage>
  )
}
