import SongPage from '../../components/songs/SongPage'
import ParallelTranslation from '../../components/ParallelTranslation'
import type { PageProps } from './types'

const title = 'ソ連国歌 (1944年)'

export const documentProps = {
  title,
  publishedAt: '2022-10-25T05:26:37+09:00'
}

const originalLyrics = `
1.
Союз нерушимый республик свободных
Сплотила навеки Великая Русь.
Да здравствует созданный волей народов
Единый, могучий Советский Союз!

Славься, Отечество наше свободное,
Дружбы народов надёжный оплот!
Знамя советское, знамя народное
Пусть от победы к победе ведёт!

2.
Сквозь грозы сияло нам солнце свободы,
И Ленин великий нам путь озарил:
Нас вырастил Сталин ― на верность народу,
На труд и на подвиги нас вдохновил!

Славься, Отечество наше свободное,
Счастья народов надёжный оплот!
Знамя советское, знамя народное
Пусть от победы к победе ведёт!

3.
Мы армию нашу растили в сраженьях.
Захватчиков подлых с дороги сметём!
Мы в битвах решаем судьбу поколений,
Мы к славе Отчизну свою поведём!

Славься, Отечество наше свободное,
Славы народов надёжный оплот!
Знамя советское, знамя народное
Пусть от победы к победе ведёт!
`
const translation = `
1.
自由な諸共和国の揺るぎない連邦を
大ルーシは永遠に団結させた!
万歳、諸民族の意思によって築かれた
1つの強力なソヴィエト連邦よ!

栄光あれ、我らの自由な祖国よ、
諸民族の友好の確かな砦よ!
ソヴィエトの旗が、人民の旗が
勝利から勝利へ導かんことを!

2.
雷雨を貫いて自由の太陽が我らに輝き
そして偉大なレーニンは我らに道を照らし示した
スターリンは我々を育てた――我らを人民への忠誠へ、
労働へ、そして偉業へ奮い立たせた!

栄光あれ、我らの自由な祖国よ、
諸民族の幸福の確かな砦よ!
ソヴィエトの旗が、人民の旗が
勝利から勝利へ導かんことを!

3.
幾度もの戦いの中で我々は軍を鍛えあげてきた
そして行く手を阻む卑劣な侵略者を一掃する!
我々は緒戦で我ら諸世代の運命を決し
我らの祖国を栄光へと導く!

栄光あれ、我らの自由な祖国よ、
諸民族の栄光の確かな砦よ!
ソヴィエトの旗が、人民の旗が
勝利から勝利へ導かんことを!
`

export function Page(props: PageProps) {
  return (
    <SongPage {...props}>
      <ParallelTranslation original={originalLyrics} translation={translation} />
    </SongPage>
  )
}
