import SongPage from '../../components/songs/SongPage'
import ParallelTranslation from '../../components/ParallelTranslation'
import type { PageProps } from './types'

const title = '勝利の日'

export const documentProps = {
  title
}

const originalLyrics = `
1.
День Победы, как он был от нас далёк,
Как в костре потухшем таял уголёк.
Были вёрсты, обгорелые, в пыли,
Этот день мы приближали как могли.

Припев:
Этот День Победы
Порохом пропах,
Это праздник
С сединою на висках.
Это радость
Со слезами на глазах.
День Победы!
День Победы!
День Победы!

2.
Дни и ночи у мартеновских печей
Не смыкала наша Родина очей.
Дни и ночи битву трудную вели -
Этот день мы приближали, как могли.

Припев.

3.
Здравствуй, мама, возвратились мы не все...
Босиком бы пробежаться по росе.
Пол-Европы, прошагали, пол-Земли,
Этот день мы приближали, как могли.

Припев.
`
const translation = `
1.
勝利の日、それは我々からなんと遠いものだったろうか
消えた焚き火に木炭が減っていくように
燃え盛る塵だらけの長い道を進んだ
その日をできるだけ早くするために

繰り返し:
この勝利の日は
火薬の臭い、
こめかみの
白髪の記念日
それは瞳に浮かんだ
涙と喜び
勝利の日!
勝利の日!
勝利の日!

2.
毎日、昼も夜も平炉のそばで
祖国は目を閉じなかった
毎日、昼も夜も困難な戦いを続けた
その日をできるだけ早くするために

繰り返し

3.
ただいま、母さん、全員は還らなかったけど
露に濡れた大地を裸足で歩けたらなあ
ヨーロッパの半分、そして地球の半分を進んだ
その日をできるだけ早くするために

繰り返し
`

export function Page(props: PageProps) {
  return (
    <SongPage {...props}>
      <ParallelTranslation original={originalLyrics} translation={translation} />
    </SongPage>
  )
}
